# #05: Membalik urutan baris dan kolom pada Data Frame

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  9  2  4  9  1
1  6  3  7  2  9
2  4  6  6  2  6
3  4  2  6  8  3
4  9  5  3  8  7

# Membalik urutan kolom

In [5]:
df.loc[:, ::-1]

   E  D  C  B  A
0  1  9  4  2  9
1  9  2  7  3  6
2  6  2  6  6  4
3  3  8  6  2  4
4  7  8  3  5  9

# Membalik urutan baris

In [7]:
df.loc[::-1]

   A  B  C  D  E
4  9  5  3  8  7
3  4  2  6  8  3
2  4  6  6  2  6
1  6  3  7  2  9
0  9  2  4  9  1

# Membalik urutan baris dan melakukan penyesuaian ulang index

In [9]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  9  5  3  8  7
1  4  2  6  8  3
2  4  6  6  2  6
3  6  3  7  2  9
4  9  2  4  9  1